[
    {
        "name":"Manti Utah Temple",
        "phone":"(+1) 435-835-2291",
        "address1":"200 East 510 North",
        "city":"Manti",
        "state":"Utah",
        "email":"manti-off@ChurchofJesusChrist.org",
        "services":"Clothing rental available, Cafeteria food served, Distribution center nearby",
        "history":"The Manti Utah Temple was the third temple built in Utah. The Manti Utah Temple was the only temple dedicated by President Lorenzo Snow. The Manti Utah Temple was originally named the Manti Temple. The Manti Utah Temple was built on a rattlesnake-infested site, known as the Manti Stone Quarry. Once Brigham Young designated the site for a temple, it became known as Temple Hill. The quarry's stone, Manti oolite, is the same cream-colored stone used for the temple exterior. Twin self-supporting, open-centered spiral staircases wind five stories up each of the octagonal towers on the west side of the Manti Utah Temple. No joints can be felt in the walnut hand railings due to the expert skills employed. The dramatic stairways are considered an engineering marvel of the pioneer Latter-day Saints. A large arching tunnel under the east tower of the Manti Utah Temple, which has since been closed, allowed cars to pass from one side of the temple to the other. The groundbreaking ceremony for the Manti Utah Temple was held a month before the groundbreaking ceremony for the Logan Utah Temple, marking the first time that two groundbreaking ceremonies were held in the same year. The two buildings share a similar castellated appearance. Lightning struck the east tower of the Manti Utah Temple in 1928, which started a fire that burned for three hours before it could be extinguished. Murals in the Manti Utah Temple were repainted in the 1940s when the deterioration of wall plaster meant the garden and world room murals by Danquart Weggeland and C.C.A. Christensen could not be saved. Robert L. Shepherd painted the Garden Room, and Minerva Teichert painted the World Room with scenes depicting Biblical stories of the Tower of Babel, Abraham, Joseph in Egypt, Moses, and Esau; worldwide expansion of the Pilgrims, oriental traders, European crusaders, and Christopher Columbus; and the North American continent with a Native American, fur trapper, pilgrim, and city of Zion. In 1985, the Manti Utah Temple was formally rededicated following a four-year renovation project that included updating the auxiliary systems; adding three sealing rooms, new dressing rooms, a nursery, and offices; restoring the pioneer craftsmanship and artwork to their former glory; and extensively renovating the baptistry including the addition of an exterior entrance. Apartments for temple workers were also constructed during the renovation. The three-day open house was attended by 40,308 visitors. In 2019, the annual Mormon Miracle Pageant was held on the grounds of the Manti Utah Temple for the last time, following a 53-year run.",
        "ordinanceschedule":"Living Ordinances Only By Appointment Only",
        "sessionschedule":"Living Ordinances Only By Appointment Only",
        "templeclosureschedule":[
            "Sunday, 11 April 2021 - Saturday, 17 April 2021",
            "Saturday, 24 July 2021",
            "Saturday, 2 October 2021",
            "Sunday, 3 October 2021 - Monday, 18 October 2021",
            "Wednesday, 24 November 2021 (Limited Operations)",
            "Thursday, 25 November 2021",
            "Friday, 24 December 2021 - Saturday, 25 December 2021",
            "Friday, 31 December 2021 (Limited Operations)"],
        "zip":"84642",
        "imageurl":"https://content.churchofjesuschrist.org/templesldsorg/bc/Temples/photo-galleries/manti-utah/1280x800/manti-temple-766504-wallpaper.jpg"
    },

    {
        "name":"Mexico City Mexico Temple",
        "phone":"(52) 55-5003-3700",
        "address1":"Avenida 510 #90",
        "city":"Col. San Juan de Aragon",
        "state":"Distrito Federal",
        "email":"mexicocity-off@ChurchofJesusChrist.org",
        "services":"Clothing rental available, Cafeteria food served, Patron housing available, Distribution center nearby",
        "history":"The Mexico City Mexico Temple was the first temple built in Mexico. The Mexico City Mexico Temple was the second temple built in a Spanish-speaking country, following the Santiago Chile Temple (1983). The Mexico City Mexico Temple is the largest temple outside of the United States. The Mexico City Mexico Temple is one of only five temples featuring an angel Moroni statue holding the gold plates. (The other four temples are the Los Angeles California Temple, the Washington D.C. Temple, the Jordan River Utah Temple, and the Seattle Washington Temple.) Even since endowments were first given in Spanish in 1945 in the Mesa Arizona Temple, faithful Mexican Saints looked forward with anticipation to the time when they might be blessed with a temple in their own country. When Church architect Emil B. Fetzer received the assignment to design the Mexico City Mexico Temple, he turned to a book on Mayan architecture, which Heber Grant Taylor and his wife felt inspired to give him 18 years earlier from the library of his grandfather President Heber J. Grant. An incredible 9,000 attended the one-hour groundbreaking ceremony of the Mexico City Mexico Temple. Elder Boyd K. Packer offered the prayer dedicating the site in Spanish. During its 10-day open house, more than 110,000 visitors toured the Mexico City Mexico Temple including thousands of government, business, and civic leaders. Mission presidents estimated 2,900 requested visits as a direct result of the open house. At the dedication of the Mexico City Mexico Temple, Elder Ezra Taft Benson received the distinct impression that God was not pleased with Church members' neglect of the Book of Mormon. Stressing the importance of the Book of Mormon would later become one of the hallmarks of his presidency. Following its completion, the Mexico City Mexico Temple received an international award for artistic use of precast concrete. The Mexico City Mexico Temple has received favorable attention from the school of architecture at the University of Mexico, becoming the subject of much study. In March 2007, the Mexico City Mexico Temple was closed for a year-and-a-half renovation and remodeling project, which included seismic enhancements, replacement of the precast concrete exterior panels, refurbishment of the angel Moroni statue, revamping of the landscaping, and remodeling of the baptistry, main lobby, corridors, sealing rooms, and ordinance rooms. By its 25th anniversary, the Mexico City Mexico Temple had dropped at least eight feet in elevation due to the rapid subsidence of Mexico's capital city. In January 2014, the Mexico City Mexico Temple closed for an 18-month renovation of the interior. Over 96,000 people toured the temple during its public open. The evening prior to the rededication, the youth of the temple district presented a cultural celebration entitled A Legacy of Faith and Sacrifice. President Henry B. Eyring, first counselor in the First Presidency, rededicated the temple. Temple History—Rededication Having participated in the original dedication of the Mexico City Mexico Temple 25 years earlier, President Thomas S. Monson returned to Mexico's capital city in November 2008 to rededicate the nation's first temple. The evening before the dedication, some 87,000 poured into Aztec Stadium—venue of the 1968 Summer Olympics and two World Cup finals—to hear the Lord's prophet and to enjoy a cultural event featuring 8,000 youth. President Monson connected with the Saints in his opening remarks, speaking of his childhood experiences with Salt Lake City's Mexican community and fondness for enchiladas. He even surprised the crowd with an impromptu verse of 'El Rancho Grande.' Following his remarks, the audience was delighted for 80 minutes with regional folk dances, reenactments of Mexican history, and a finale procession of full-time missionaries set to a medley of hymns. The evening closed with an exchange of handkerchief waves between the Lord's servants and the tens of thousands of attendees.1 On dedication day, thousands of Mexican members participated in the two rededicatory sessions, which were held in the temple and also broadcast to meetinghouses in Mexico and Spanish-speaking congregations in the United States. Following the dedicatory prayer, President Monson expressed his love for the Mexican people and his assurance of the continued growth of the Church and of temple building in Mexico. 'There will be more,' he said.",
        "ordinanceschedule":"Living Ordinances Only By Appointment Only",
        "sessionschedule":"Living Ordinances Only By Appointment Only",
        "templeclosureschedule":[
            "Monday, 28 June 2021 - Monday, 12 July 2021",
            "Saturday, 2 October 2021",
            "Friday, 24 December 2021 - Saturday, 25 December 2021",
            "Friday, 31 December 2021"],
        "zip":"07950",
        "imageurl":"https://content.churchofjesuschrist.org/templesldsorg/bc/Temples/photo-galleries/mexico-city-mexico/1280x800/mexico-city-temple-exterior-1518357-wallpaper.jpg"
    } ,   
    {
        "name":"San Antonio Texas Temple",
        "phone":"(1) 210-538-0034",
        "address1":"20080 Stone Oak Pkwy",
        "city":"San Antonio",
        "state":"Texas",
        "email":"sanantonio-off@ChurchofJesusChrist.org",
        "services":"Distribution center nearby",
        "history":"On September 21, 2004, a 13-foot, gold-leafed statue of the angel Moroni was placed atop the San Antonio Texas Temple, coinciding with the 181st anniversary of the first appearance of Moroni to Joseph Smith.1 During its three-week open house period, the temple saw more than 50,000 visitors enter its doors including missionaries of San Antonio-based Evidence Ministries. Church representatives gave a tour to these missionaries, who stood on the streets every day of the open house distributing thousands of copies of an eight-page tabloid to passing motorists. Despite Ministries' claims that the Church misrepresents its differences with traditional Christianity, the Church interacted peacefully with Ministries' missionaries, even giving them use of its meetinghouse bathrooms.2 The evening before the temple dedication, 20,000 people filled the Alamodome for a cultural celebration, featuring fireworks, horses, and over 4,000 singers and dancers. The various presentations reflected on Texas history, patriotism, the importance of family values, and the story of The Church of Jesus Christ of Latter-day Saints. In promoting the celebration, producer Gary Bradley noted, 'It'll make people proud, and some parts of it will make people cry.' Two hours before the musical celebration began, President Gordon B. Hinckley delighted the audience with a speech focused on the temple.",
        "ordinanceschedule":"Living Ordinances Only By Appointment Only",
        "sessionschedule":"Living Ordinances Only By Appointment Only",
        "templeclosureschedule":[
            "Saturday, 2 October 2021",
            "Monday, 4 October 2021 - Monday, 25 October 2021",
            "Wednesday, 24 November 2021 (Limited Operations)",
            "Thursday, 25 November 2021",
            "Friday, 24 December 2021",
            "Saturday, 25 December 2021",
            "Friday, 31 December 2021"],
        "zip":78258,
        "imageurl":"https://content.churchofjesuschrist.org/templesldsorg/bc/Temples/photo-galleries/san-antonio-texas/1280x800/san-antonio-temple-lds-867160-wallpaper.jpg"
    },

    {
        "name":"Hong Kong China Temple",
        "phone":"(+852) 2339-8100",
        "address1":"2 Cornwall St",
        "city":"Kowloon City",
        "state":"Hong Kong",
        "email":"honkkong-off@ChurchofJesusChrist.org",
        "services":"Clothing rental available, Patron housing available, Distribution center nearby",
        "history":"The Hong Kong China Temple was the first temple built in China and the second built in mainland Asia, following the Seoul Korea Temple (1985). The Hong Kong China Temple is the only temple that opens each quarter on Sunday to accommodate members, mostly Filipino sisters, who are employed as domestic workers six days a week. The Hong Kong China Temple is the only temple to have had a steeple and angel Moroni statue permanently removed as part of a renovation. The steeple stood atop the building from the time of its dedication in 1996 until its renovation closure in 2019. The Hong Kong China Temple was originally named the Hong Kong Temple. The Hong Kong China Temple was originally a multipurpose building, as envisioned and sketched by President Gordon B. Hinckley in the nighttime hours following a pleading prayer for inspiration while on a trip to Hong Kong to locate a site for the temple. The Hong Kong China Temple originally housed a temple (subbasement, 1st, 3rd, 4th, and 5th floors), a meetinghouse (basement and 1st floor), a family history center (subbasement), a small mission office (2nd floor), and three apartments (2nd floor) for the temple president and matron, mission president and companion, and mission office missionaries. The sealing rooms were located on the 5th floor; the two endowment rooms, celestial room, and women's dressing rooms on the 4th floor; the men's dressing rooms, temple offices, and waiting area on the 3rd floor; the recommend desk on the 1st floor; and the baptistry in the subbasement. Elder David O. McKay of the Quorum of the Twelve Apostles dedicated China for the preaching of the gospel on January 9, 1921, within the walls of the 'Forbidden City' in Beijing. Elder Matthew Cowley, a member of the Quorum of the Twelve Apostles, and Chinese native Henry Aki officially opened missionary work in Hong Kong by prayer on July 14, 1949, from the Peak—the highest point overlooking the city of Hong Kong. The Kowloon Tong chapel, Hong Kong mission home, and Hong Kong mission office, which stood on side-by-side lots, were all razed to make way for the Hong Kong China Temple. The temple originally housed replacements for these facilities, but later, the Church constructed a meetinghouse, housing facilities, mission office, and distribution center across the street. Elder John K. Carmack of the Seventy presided over the groundbreaking ceremony of the Hong Kong China Temple. Invited to attend were Hong Kong stake and ward leaders, their wives, and invited guests. The angel Moroni statue was added to the spire of the Hong Kong China Temple on December 12, 1995. Several hundred spectators gathered to witness the Moroni raising. During its public open house, over 13,000 people toured the interior of the Hong Kong China Temple including over 500 VIP guests and 25 ministers of other faiths. The Hong Kong China Temple was dedicated in seven sessions over two days. President Gordon B. Hinckley, who dedicated the temple, had participated in the dedication or rededication of all but five of the Church's operating temples. Hong Kong was under British rule at the time the Hong Kong China Temple was dedicated, but sovereignty transferred to China just over a year later on July 1, 1997. Following the dedication of the Hong Kong China Temple, President Gordon B. Hinckley became the first president of the Church to visit mainland China when he arrived in Shenzhen—a 'sister cultural city' of the Polynesian Cultural Center in Hawaii. A replacement angel Moroni statue was hoisted atop the Hong Kong China Temple on August 5, 2016, just over 20 years following the dedication. It was permanently removed in 2019 as part of a major renovation of the interior and exterior.",
        "ordinanceschedule":"Living Ordinances Only By Appointment Only",
        "sessionschedule":"Living Ordinances Only By Appointment Only",
        "templeclosureschedule":[
            "Closed For Renovation"],
        "zip":"",
        "imageurl":"https://cdn.vox-cdn.com/thumbor/0sTw9yKsQjNgqVraHGuXZj94MuQ=/0x0:900x1200/1200x800/filters:focal(397x627:541x771)/cdn.vox-cdn.com/uploads/chorus_image/image/66252104/merlin_1253117.0.jpg"
    } 
]